app/controllers/todo_items_controller.rb

  def create
  	@todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "First"], ["todo_list_id", 1], ["created_at", "2015-12-17 21:33:43.406320"], ["updated_at", "2015-12-17 21:33:43.406320"]]

  def destroy
    if @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 3]]

  def complete
    @todo_item.update_attribute(:completed_at, Time.now)
---
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2015-12-20 12:03:25.683828"], ["updated_at", "2015-12-20 12:03:25.685079"], ["id", 4]]

  	def set_todo_list
  	  @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 1]]

    def set_todo_item
      @todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", 4]]